<h1>Привіт, {{ $order->name }}!</h1>
<div>
    Дякуємо за замовлення!
    Ви не помилились, що обрали нашу "Лавку"! Ми зробимо все, щоб стати для Вас найкращім магазином
    "hand-made" товарів та товарів для рукоділля!
    <br>
    <br>
    Надсилаємо Вам рахунок на оплату замовлення №{{ $invoice->id }}
    <p>
       <a href="{{ $link }}">Натисніть, щоб переглянути pdf-файл рахунку.</a>
    </p>
    <br>
    ----------------------------------------
    <br>
    Ми цінуємо Ваш час!
    <br>
    З повагою, "Лавка-Булавка"!
    <br>
    (063) 153 80 28 - адміністратор, Олена
    <br>
    admin@bulavka.org
</div>