@extends('layouts.main')
@section('content')
@php($text = "Відбувся майстер-клас по ДЕКУПАЖУ!")
@include('news.header', ['text' => $text ])
<div class="container-fluid">
	<div class="container">
		<div class="row" style="padding-top: 40px;">
			<div class="col-md-12">
				<p style="text-align: justify;">Lorem ipsum — классическая панграмма, условный, зачастую бессмысленный текст-заполнитель, вставляемый в макет страницы. Является искажённым отрывком из философского трактата Марка Туллия Цицерона «О пределах добра и зла», написанного в 45 году до н. э. на латинском языке. Lorem ipsum — классическая панграмма, условный, зачастую бессмысленный текст-заполнитель, вставляемый в макет страницы. Является искажённым отрывком из философского трактата Марка Туллия Цицерона «О пределах добра и зла», написанного в 45 году до н. э. на латинском языке. Lorem ipsum — классическая панграмма, условный, зачастую бессмысленный текст-заполнитель, вставляемый в макет страницы. Является искажённым отрывком из философского трактата Марка Туллия Цицерона «О пределах добра и зла», написанного в 45 году до н. э. на латинском языке.</p>
			</div>
		</div>
		<div class="row">
			<div class="col-md-12">
				<img src="img/tea.png" width="100%" alt="">
			</div>
		</div>
		<div class="row">
			<div class="col-md-12">
				<p style="text-align: justify;">Lorem ipsum — классическая панграмма, условный, зачастую бессмысленный текст-заполнитель, вставляемый в макет страницы. Является искажённым отрывком из философского трактата Марка Туллия Цицерона «О пределах добра и зла», написанного в 45 году до н. э. на латинском языке. Lorem ipsum — классическая панграмма, условный, зачастую бессмысленный текст-заполнитель, вставляемый в макет страницы. Является искажённым отрывком из философского трактата Марка Туллия Цицерона «О пределах добра и зла», написанного в 45 году до н. э. на латинском языке. Lorem ipsum — классическая панграмма, условный, зачастую бессмысленный текст-заполнитель, вставляемый в макет страницы. Является искажённым отрывком из философского трактата Марка Туллия Цицерона «О пределах добра и зла», написанного в 45 году до н. э. на латинском языке. Lorem ipsum — классическая панграмма, условный, зачастую бессмысленный текст-заполнитель, вставляемый в макет страницы. Является искажённым отрывком из философского трактата Марка Туллия Цицерона «О пределах добра и зла», написанного в 45 году до н. э. на латинском языке.</p>
			</div>
		</div>
		<div class="row" style="padding-bottom: 40px;">
			<div class="col-md-4">
				<img src="img/tea.png" width="100%" alt="">
			</div>
			<div class="col-md-4">
				<img src="img/tea.png" width="100%" alt="">
			</div>
			<div class="col-md-4">
				<img src="img/tea.png" width="100%" alt="">
			</div>
		</div>
	</div>
</div>
@endsection